In [129]:
import pandas as pd
import numpy as np
import copy
from sklearn.preprocessing import MinMaxScaler,LabelEncoder
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
import warnings
warnings.filterwarnings('ignore')

data_path='./Data/'
df=pd.read_csv(data_path+'titanic_train.csv')

train_Y=df['Survived']
df=df.drop(['PassengerId','Survived'],axis=1)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [130]:
#D29-1
grouped=df['Fare'].groupby(df['Cabin'])
mean_df=grouped.mean()
#mode_df=grouped.apply(lambda x:x.mode())
median_df=grouped.median()
max_df=grouped.max()
min_df=grouped.min()

temp=pd.merge(mean_df,median_df,how='left',on=['Cabin'])
temp=pd.merge(temp,max_df,how='left',on=['Cabin'])
temp=pd.merge(temp,min_df,how='left',on=['Cabin'])
temp.columns=['Fare_Mean','Fare_Median','Fare_Max','Fare_Min']
print(temp)

        Fare_Mean  Fare_Median  Fare_Max  Fare_Min
Cabin
A10     40.125000     40.12500   40.1250   40.1250
A14     52.000000     52.00000   52.0000   52.0000
A16     39.600000     39.60000   39.6000   39.6000
A19     26.000000     26.00000   26.0000   26.0000
A20     56.929200     56.92920   56.9292   56.9292
A23     30.000000     30.00000   30.0000   30.0000
A24     50.495800     50.49580   50.4958   50.4958
A26     35.500000     35.50000   35.5000   35.5000
A31     31.000000     31.00000   31.0000   31.0000
A32     50.000000     50.00000   50.0000   50.0000
A34     81.858300     81.85830   81.8583   81.8583
A36      0.000000      0.00000    0.0000    0.0000
A5      34.654200     34.65420   34.6542   34.6542
A6      35.500000     35.50000   35.5000   35.5000
A7      30.695800     30.69580   30.6958   30.6958
B101   512.329200    512.32920  512.3292  512.3292
B102     0.000000      0.00000    0.0000    0.0000
B18     57.979200     57.97920   57.9792   57.9792
B19     33.500000     33.50000   33.5000   33.5000
B20     57.000000     57.00000   57.0000   57.0000
B22     71.000000     71.00000   71.0000   71.0000
B28     80.000000     80.00000   80.0000   80.0000
B3     211.337500    211.33750  211.3375  211.3375
B30     61.979200     61.97920   61.9792   61.9792
B35     69.300000     69.30000   69.3000   69.3000
B37     29.700000     29.70000   29.7000   29.7000
B38     26.550000     26.55000   26.5500   26.5500
B39     49.500000     49.50000   49.5000   49.5000
B4      27.720800     27.72080   27.7208   27.7208
B41     79.200000     79.20000   79.2000   79.2000
...           ...          ...       ...       ...
E12     26.550000     26.55000   26.5500   26.5500
E121    12.475000     12.47500   12.4750   12.4750
E17     26.550000     26.55000   26.5500   26.5500
E24     26.287500     26.28750   26.2875   26.2875
E25     26.337500     26.33750   26.3875   26.2875
E31     61.175000     61.17500   61.1750   61.1750
E33     55.000000     55.00000   55.0000   55.0000
E34    134.500000    134.50000  134.5000  134.5000
E36     56.929200     56.92920   56.9292   56.9292
E38     26.550000     26.55000   26.5500   26.5500
E40    134.500000    134.50000  134.5000  134.5000
E44     55.900000     55.90000   55.9000   55.9000
E46     51.862500     51.86250   51.8625   51.8625
E49     83.158300     83.15830   83.1583   83.1583
E50     55.441700     55.44170   55.4417   55.4417
E58     25.587500     25.58750   25.5875   25.5875
E63     38.500000     38.50000   38.5000   38.5000
E67     79.650000     79.65000   79.6500   79.6500
E68     79.650000     79.65000   79.6500   79.6500
E77     10.500000     10.50000   10.5000   10.5000
E8      53.100000     53.10000   53.1000   53.1000
F E69   22.358300     22.35830   22.3583   22.3583
F G63    7.650000      7.65000    7.6500    7.6500
F G73    7.650000      7.65000    7.6500    7.6500
F2      26.000000     26.00000   26.0000   26.0000
F33     11.333333     10.50000   13.0000   10.5000
F38      7.750000      7.75000    7.7500    7.7500
F4      39.000000     39.00000   39.0000   39.0000
G6      13.581250     13.58125   16.7000   10.4625
T       35.500000     35.50000   35.5000   35.5000

[147 rows x 4 columns]

In [131]:
df=pd.merge(df,temp,how='left',on=['Cabin'])
df=df.drop(['Cabin'],axis=1)

df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Fare_Mean,Fare_Median,Fare_Max,Fare_Min
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,NaN,NaN,NaN,NaN
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,71.2833,71.2833,71.2833,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,NaN,NaN,NaN,NaN
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,53.1000,53.1000,53.1000,53.1000
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,NaN,NaN,NaN,NaN

In [132]:
num_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64' or dtype == 'int64':
        num_features.append(feature)
print(f'{len(num_features)} Numeric Features : {num_features}\n')

# 削減文字型欄位, 只剩數值型欄位
df = df[num_features]
df = df.fillna(-1)
MMEncoder = MinMaxScaler()
df.head()

9 Numeric Features : ['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Fare_Mean', 'Fare_Median', 'Fare_Max', 'Fare_Min']

,Pclass,Age,SibSp,Parch,Fare,Fare_Mean,Fare_Median,Fare_Max,Fare_Min
0,3,22.0,1,0,7.2500,-1.0000,-1.0000,-1.0000,-1.0000
1,1,38.0,1,0,71.2833,71.2833,71.2833,71.2833,71.2833
2,3,26.0,0,0,7.9250,-1.0000,-1.0000,-1.0000,-1.0000
3,1,35.0,1,0,53.1000,53.1000,53.1000,53.1000,53.1000
4,3,35.0,0,0,8.0500,-1.0000,-1.0000,-1.0000,-1.0000

In [133]:
#D29-2, Oringinal features with Logistic Reg

df_minus=df.drop(['Fare_Mean','Fare_Median','Fare_Max','Fare_Min'],axis=1)

train_X=MMEncoder.fit_transform(df_minus)
estimator=LogisticRegression()
print(f' Original features with Logistic Reg:{cross_val_score(estimator,train_X,train_Y,cv=5).mean()}\n')

 Original features with Logistic Reg:0.7038635542329971

In [134]:
#D29-2, new features with Logistic Reg
train_X=MMEncoder.fit_transform(df)
print(f' New features with Logistic Reg:{cross_val_score(estimator,train_X,train_Y,cv=5).mean()}\n')

 New features with Logistic Reg:0.7016164341491042